#ifndef _CONFIG_H_
#define _CONFIG_H_ 1

////////////////////////////////////////////////////////////////////////////////
// Константы
////////////////////////////////////////////////////////////////////////////////

// настройки записи на карту

// Максимальные адрес (размер файла в байтах)
// 4 МегаБайта (4 194 304) при длине записи 128 байт хватит на 32 768 записей
// или 546 часов и 8 минут (более 3 недель) непрерывной работы
// при осуществлении записи со скоростью 1 раз в минуту
#define MAXADDR (0x400000UL)

#define FILENAME ("ecodat.csv")

#define NOTE_SIZE 128

// настройки интерфейса SPI

#define SPI_PORTX   PORTB
#define SPI_DDRX    DDRB

#define SPI_MOSI   3
#define SPI_MISO   4
#define SPI_SCK    5
#define SPI_SS     0


// Буква порта с датчиком температуры и влажности DHT11 или DHT22
#define DHT_PORTNAME B

// Номер вывода в порте
#define DHT_WIRE 1

#define EMPTY_NOTE_TEMPLATE {                                                      \
'!', '!', '!', '!', '!', ';', '!', '!',  '!', ',', '!', ';', '!', '!', '!', ',',   \
'!', ';', '!', '!', ';', '!', '!', '!',  '!', ';', '!', '!', '!', ',', '!', ';',   \
'!', '!', '.', '!', '!', '.', '!', '!',  ';', '!', '!', ':', '!', '!', ':', '!',   \
'!', ';', '!', '!', '°', '!', '!', '.',  '!', '!', '!', '!', ',', '!', ';', '!',   \
'!', '!', '°', '!', '!', '.', '!', '!',  '!', '!', ',', '!', ';', '!', '!', '!',   \
'.', '!', '!', ';', '!', '!', '!', '.',  '!', '!', ';', '_', '_', '_', '_', '_',   \
'_', '_', '_', '_', '_', '_', '_', '_',  '_', '_', '_', '_', '_', '_', '_', '_',   \
'_', '_', '_', '_', '_', '_', '_', '_',  '_', '_', '_', '_', '_', '_', 0xD, 0xA };


#endif  /* _CONFIG_H_ */
